app/controllers/contacts_controller.rb

  def show
    @contacts = Contact.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("created_at", "email", "firstname", "lastname", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 06 Dec 2014 14:39:50 UTC +00:00], ["email", "johndoe9@example.com"], ["firstname", "John"], ["lastname", "Doe"], ["updated_at", Sat, 06 Dec 2014 14:39:50 UTC +00:00]]